Revit 2024 API
PickedBox Class
A class that contains two XYZ points representing the pick box on the screen.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class PickedBox
Visual Basic
Public Class PickedBox
Visual C++
public ref class PickedBox
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Selection.PickedBox
See Also
PickedBox Members
Autodesk.Revit.UI.Selection Namespace